# Este archivo contiene los comandos necesarios para hacer la 
# sintesis de la maquina de estados Automatic-Parking-Access-Control

# read design 
read_verilog Automatic-Parking-Access-Control.v

# elaborate design hierarchy
hierarchy -check -top ControladorParqueo

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to cmos_cells.lib
dfflibmap -liberty ./cmos_cells.lib

# mapping logic to cmos_cells.lib
abc -liberty ./cmos_cells.lib

#Generate GraphViz output
show

# cleanup
clean

# write synthesized design
write_verilog APAC_synth.v